//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="מבצע את שלב ‎%d מתוך ‎%d: בניית חנות הישויות";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="מבצע את שלב ‎%d מתוך ‎%d: יצירת בסיס נתונים של bootstrap";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="מבצע את שלב ‎%d מתוך ‎%d: יצירת בסיס נתונים של תור בקשות";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="מבצע את שלב ‎%d מתוך ‎%d: הורדת חנות ישויות. התקבלו ‎%s מתוך ‎%s עד כה.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="מבצע את שלב ‎%d מתוך ‎%d: מחיקת בקשות שתוקפן פג";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="מבצע את השלב ‎%d מתוך ‎%d: טעינת מטה-נתונים";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="מבצע את שלב ‎%d מתוך ‎%d: ביצוע מיזוג תור בקשות";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="מבצע את שלב ‎%d מתוך ‎%d: ביצוע מיזוג טרנזקציות";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="מבצע את שלב ‎%d מתוך ‎%d: ביצוע מיזוג של מחיקה יצירה";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="מבצע את שלב ‎%d מתוך ‎%d: עיבוד שאילתות מגדירות ‎%s באמצעות ‎%s";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="מבצע את שלב ‎%d מתוך ‎%d: עיבוד בקשות. שליחת בקשת שינוי ‎%s מתוך ‎%s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="מבצע את שלב ‎%d מתוך ‎%d: החלת שינויים מחדש";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="מבצע את שלב ‎%d מתוך ‎%d: ניתוח נתונים שהתקבלו";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="מבצע את שלב ‎%d מתוך ‎%d: קבלת נתונים מהשרת. התקבלו ‎%s עד כה.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="מבצע את שלב ‎%d מתוך ‎%d: הסרת קשרים שנמחקו";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="מבצע את שלב ‎%d מתוך ‎%d: הסרת בקשות שצוינו כ-RemoveAfterUpload";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="מבצע את שלב ‎%d מתוך ‎%d: שליחת נתונים לשרת. התקבלו ‎%s עד כה.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="מבצע את שלב ‎%d מתוך ‎%d: שליחת בסיס נתונים של חנות ישויות. נשלחו ‎%s מתוך ‎%s עד כה.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="מבצע את שלב ‎%d מתוך ‎%d: שליחת בסיס נתונים של תור בקשות. נשלחו ‎%s מתוך ‎%s עד כה.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="מבצע את שלב ‎%d מתוך ‎%d: התחלת תקשורת עם השרת";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="מבצע את שלב ‎%d מתוך ‎%d: עיבוד מקדים של בקשות לפני טעינה";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="מבצע את שלב ‎%d מתוך ‎%d: המתנה להורדה";

